"""
Модуль, инкапсулирующий в себе работу
с историей изменения базы данных

Автор: Перятин Виталий
Отключены следующие ошибки pylint:
    R0903 - Мало методов у класса
    R0201 - self не используется методом
"""
# pylint: disable=R0903
# pylint: disable=R0201


class ChangeViewer:
    """
    Кэширует историю изменения базы данных

    Автор: Перятин Виталий
    """
    def get_history(self):
        """
        Получает историю изменений базы данных
        :return: список событий

        Автор: Перятин Виталий
        """
        data = [
            ("black", "Строка 1"), ("red", "Строка 2"),
            ("red", "Строка 3"), ("red", "Строка 4"),
            ("red", "Строка 5"), ("red", "Строка 6"),
            ("red", "Строка 7"), ("red", "Строка 8"),
            ("red", "Строка 9"), ("white", "Строка 10"),
            ("white", "Строка 11"), ("red", "Строка 12"),
            ("red", "Строка 13"), ("red", "Строка 14"),
            ("red", "Строка 15"), ("red", "Строка 16"),
            ("red", "Строка 17"), ("red", "Строка 18"),
            ("red", "Строка 19"), ("black", "Строка 20")
        ]
        return data
