class ChangeViewer:
    def get_history(self):
        data = [
            ("black", "чё-то добавилось"), ("red", "удалили то-то"),
            ("red", "Ошибка чего то там"), ("red", "хз что произошло"),
            ("red", "Наиль лох"), ("red", "и не только он"),
            ("red", "(я тоже лох)"), ("red", "Но зато я не Наиль"),
            ("red", "что хорошо"), ("white", "конечноже"),
            ("white", "чё-то добавилось"), ("red", "удалили то-то"),
            ("red", "Ошибка чего то там"), ("red", "хз что произошло"),
            ("red", "Наиль лох"), ("red", "и не только он"),
            ("red", "(я тоже лох)"), ("red", "Но зато я не Наиль"),
            ("red", "что хорошо"), ("black", "конечноже")
        ]
        return data
